{
  "display_feeds": [
    {
      "id": "1",
      "author": "Mikey Dickerson",
      "title": " DOES YOUR DOG HAVE A SENSITIVE STOMACH?",
      "description": "Dogs are omnivores",
      "reading_time": "4 min read ",
      "date": "MAY 31 2022",
      "source": {
        "name": "PawsIndia"
      },
      "profile_url": "https://cdn.shopify.com/s/files/1/1199/8502/articles/start_5_590x.jpg?v=1653980577",
      "urlToImage": "https://cdn.shopify.com/s/files/1/1199/8502/files/4_28.jpg?v=1653977845",
      "content": "Dogs are omnivores, which means they consume both meat and veggies. Because of their wide palette and ability to consume large amounts of food in one sitting, they have a gluttonous reputation (owing to an incredibly elastic stomach). While most dogs are not afraid to consume almost any meal (or non-food!) that comes their way, others are more sensitive. Your dog's stomach might be upset for a variety of causes, ranging from indigestion to cancer. While all dogs vomit from time to time, it's time to take your dog to the vet for a check-up if they vomit or have diarrhoea on a regular or continuous basis. Chronic or recurring vomiting or diarrhoea suggests that your dog's health is failing and should be addressed. Your veterinarian will be able to examine your dog and, if necessary, conduct tests to provide an accurate diagnosis and treatment.",
      "likes": 17,
      "tag": [
        "Dog"
      ],
      "comment": [
        "hii",
        "hii",
        "hii",
        "Pixie my love",
        "Hii",
        "hhioii",
        "fds",
        "ankit"
      ]
    },
    {
      "id": "2",
      "author": "Mikey Dickerson",
      "title": "How food can be the cause of a sensitive stomach in your dog",
      "description": "Every dog is unique in its way",
      "reading_time": "5 min read ",
      "date": "JUNE 1 2022",
      "source": {
        "name": "PawsIndia"
      },
      "profile_url": "https://cdn.shopify.com/s/files/1/1199/8502/files/3_29_1c724856-b0fb-4abc-a308-bf478deeda51.jpg?v=1653979426",
      "urlToImage": "https://cdn.shopify.com/s/files/1/1199/8502/files/7_14.jpg?v=1653979980",
      "content": "Protein: Some dogs have trouble digesting certain forms of protein. If your dog is on a chicken-based diet, for example, consider moving to a different protein source, such as lamb, or fish, to see if the problem goes away.Fibre: Dogs, like us, sometimes require a little additionalfibre in their diets. Beet pulp is a rich source of fibre for dogs, and it improves faecal quality without reducing other nutrient digestibility.Fats: High-fat diets are more difficult to digest than low-fat or high-carbohydrate diets. Check the first four ingredients on your dog's current diet for fats and oils. This could mean the food is too heavy in fat for your dog's digestive system to handle. Compare the fat content of your current food to that of other brands to locate a fat-free option.Vitamins & Minerals: The majority of commercial dog diets have enough vitamins and minerals in their recipes. However, if you provide a speciality food to your dogs, such as a raw diet or a freshly cooked dinner, your dog may be deficient in some nutrients. Consult your veterinarian to ensure that you are providing your dog with all of the necessary nutrients.",
      "likes": 18,
      "tag": [
        "Dogs"
      ],
      "comment": [
        "HeLLo hii",
        "hjhdshc",
        "hello",
        "hello",
        "hello"
      ]
    },
    {
      "id": "3",
      "author": "Adam Renton",
      "title": "TIPS FOR RAISING A HAPPY INDOOR CAT",
      "description": "CATS are perceived as fairly independent beings",
      "reading_time": "6 min read ",
      "date": "Feb 21",
      "source": {
        "name": "PetsLove"
      },
      "profile_url": "https://cdn.shopify.com/s/files/1/1199/8502/files/1.1.jpg?v=1652332257",
      "urlToImage": "https://cdn.shopify.com/s/files/1/1199/8502/files/4_27.jpg?v=1652334881",
      "content": "CATS are perceived as fairly independent beings, thanks to their lazy and carefree attitude. They are very popular beings and were used as working animals to eradicate rats and mice for thousands of years. These curious beings are natural hunters and hence, they get bored easily. Keeping an indoor cat happy can be a difficult task, particularly if the cat is kept inside all day long. Domesticated cats simply act on their instincts when they prey on wild birds and other wildlife.  Whereas, outdoor cats confront a variety of dangers when they reside in the city, the suburbs, or the country. They are at risk of contracting contagious infections, the majority of which are fatal. Free-roaming cats also suffer greatly from traffic, and while many people assume their pets are street-wise, no cat looks both ways when being chased by another animal. Poisons, leg-hold traps, pet theft, and brutal treatment by cruel individuals are all potential hazards that a cat has to go through when out on the streets. Outdoor cats who roam freely are at risk of dying young, whereas cats who stay indoors or use a shelter can live for 15 years or more. Indoor cats are also typically healthier and free from any communicable diseases, parasites, and abscesses caused by conflicts with other animals. While cats appreciate sunshine, fresh air, and exercise, they do not require going outside to be content. Indoor cats can lead happy lives with some innovative planning on the part of their human caretakers. They cannot be taught to suppress their inherent hunting impulses. So, the only sure method to keep them safe is to keep them indoors.If you’re looking to raise a happy indoor cat and continue to live in peace with them, the following tips will be of great help:",
      "likes": 30,
      "tag": [
        "Cats"
      ]
    },
    {
      "id": "4",
      "author": "Jessie Yeung",
      "title": "How TO TAKE CARE OF CAT FOOD",
      "description": "It's a good idea to set up a feeding schedule for most cats",
      "reading_time": "5 min read ",
      "date": "Feb 21",
      "source": {
        "name": "ONEzEE"
      },
      "profile_url": "https://cdn.shopify.com/s/files/1/1199/8502/files/7_13.jpg?v=1652335118",
      "urlToImage": "https://cdn.shopify.com/s/files/1/1199/8502/files/5_25.jpg?v=1652334204",
      "content": "It's a good idea to set up a feeding schedule for most cats, which is usually two meals a day, spaced 8 to 12 hours apart. Your veterinarian can advise you on how much your pet should eat daily based on their size and activity level. Even if you're worried about your cat becoming hungry, it's better not to leave a bowl of food available all day.The result could be that your cat eats as much as they can, causing them to gain too much weight. If your cat begs for food while you're eating, resist the temptation to feed them from your plate. Onions, garlic, raisins, some nuts, and chocolate, among other human foods, are toxic to cats. Other foods, such as milk, are difficult to digest for many cats and can make them unwell. Also, make sure your cat has access to fresh water at all times.",
      "likes": 67,
      "tag": [
        "Cat Food"
      ],
      "comment": []
    },
    {
      "id": "5",
      "author": "Carla Starr",
      "title": "How to Keep your Rabbits Cool in Summer",
      "description": "The summer has arrived",
      "reading_time": "7 min read ",
      "date": "Feb 21",
      "source": {
        "name": "Hack Life"
      },
      "profile_url": "https://www.thepetexpress.co.uk/blog-admin/wp-content/uploads/2011/08/Rabbits-e1554473878896.jpg",
      "urlToImage": "https://djl0zc68j5bhe.cloudfront.net/image_resize/crop/w437/h285/blog-admin/wp-content/uploads/2011/10/winter-rabbit.jpg",
      "content": "The summer has arrived and while many of us are enjoying the wonderful hot weather of the season, our pets may not be enjoying it quite so much.Rabbits in particular are vulnerable to heat stroke and rely on their owners to provide them with cooler conditions during the summer months. Wild rabbits go underground or hide under shrubs and bushes to keep cool, so here we look at how, as pet owners, we can help in keeping rabbits cool in the hot weather.Keep your rabbit hutch out of direct sunlight as much as possible. Metal hutches in particular can warm up very quickly and will retain the heat throughout the day. Placing your hutch in a shaded area of your garden is ideal, preferably under a tree or large bush in order to allow some light to shine through, whilst protecting your rabbits from intense heat.  If you are unable to move your hutch, then try placing a large sun umbrella close by. This will help to break up the intensity of the sunlight.The same applies to your rabbit run, as they are mostly made of wire mesh and are completely exposed to the sun's harmful rays.  A lightweight cover that allows the wind to circulate and keep it ventilated, but also offers shelter from the sun, will ensure they can enjoy their exercise time without overheating.      Try placing some ceramic or slate tiles inside the rabbit hutch. They are a cold material and your rabbits will like the cooling feeling against their body as they lie on top. A tunnel or hideaway is also a great idea for inside the hutch, perfect for an extra layer of shade.A fresh supply of water is always essential and this should be replenished at regular intervals throughout the day during the summer months. A combination of water bowls and bottles will give your rabbit access to plenty of liquids and you may find that they even enjoy lying in the bowls when the weather is extremely hot.Adding ice-cubes to the water bowl will offer some cooling relief, as will offering a supply of fresh vegetables. These naturally contain a large amount of water and your rabbit will enjoy munching on them during those long hot days, whilst being kept hydrated at the same time.",
      "likes": 12,
      "tag": [
        "Rabbit"
      ]
    },
    {
      "id": "6",
      "author": "Laura Jackson",
      "title": "HOW TO SPOT HEAT STROKE SYMPTOMS IN RABBITS",
      "description": "Heatstroke in rabbits can be fatal",
      "reading_time": "5 min read ",
      "date": "Feb 12",
      "source": {
        "name": "heatwaveblog"
      },
      "profile_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTVuhoeLq-IEFTz3XEBDdfmVtwm8VgVfLr4m0nuDqGZlnQRaKuHjvMGcBzZUUQOgjTdOO4&usqp=CAU",
      "urlToImage": "https://968252.smushcdn.com/2741694/wp-content/uploads/2022/06/Why-Rabbit-Dont-Drink-Water-750x375.jpg?lossy=1&strip=1&webp=1",
      "content": "Heatstroke in rabbits can be fatal, as for other small animals. If you can spot the symptoms of heat stoke in the early stages, then you will have time to reverse the effects. The main symptoms to look out for are-Fast, shallow breathing, Wetness around the nose,Breathing rapidly from an open mouth whilst throwing their head back,Hot ears.If you are worried that your rabbit has heat stroke, take them indoors and into a cool, well ventilated room immediately. Do not submerge them in cold water as this can send them into shock, but do apply a cool compress to their ears. Offer them plenty of cool, fresh water and keep them calm. If they do not appear to be getting better within a short space of time, take them your local vet straight away. Keep your rabbit cool and fresh this summer and avoid them becoming a hot cross bunny!",
      "likes": 32,
      "tag": [
        "Heatstroke"
      ]
    },
    {
      "id": "7",
      "author": "Marina Gomez",
      "title": "How to Care for your Tortoise",
      "description": "A tortoise is a wonderful pet to have",
      "reading_time": "4 min read ",
      "date": "Jan 14",
      "source": {
        "name": "Thepetexpress"
      },
      "profile_url": "https://www.thepetexpress.co.uk/blog-admin/wp-content/uploads/2011/08/tortoise-2.jpg",
      "urlToImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBBWLEGcQIQpq_zNXyOuqFG4RlPVI696thUGbu5IWymmTjPvgrv5nnC9Ud6-2dbifXXro&usqp=CAU",
      "content": "A tortoise is a wonderful pet to have, but like all exotic creatures they have specific needs and some basic requirements that must be met in order to keep them happy and healthy.If cared for properly a tortoise will have a very long lifespan, with many living to be over 100 years old. This is why, before taking one of these delightful pets into your home, you should consider that it will most likely be a lifelong commitment and they may well outlive you! When deciding whether or not a tortoise is right for you, you should think about where it will live, what conditions it will need and how much time and attention you will need to provide.",
      "likes": 17,
      "tag": [
        "Nature"
      ]
    },
    {
      "id": "8",
      "author": "Brock Corleone",
      "title": "HOw DO I HOUSE A TORTOISE?",
      "description": "The right tortoise house is essential and sadly many tortoises do not thrive in a classic Vivarium style enclosure.",
      "reading_time": "6 min read ",
      "date": "Jan 24",
      "source": {
        "name": "tortise-care-sheet"
      },
      "profile_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRHEV90943ir46Sxcqxv2gaxzJW-oD-l12i4eAC7jYvfAmsQ5dDxXBdkDJmWXJtg1oDykk&usqp=CAU",
      "urlToImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTt8NO0-x_NZCAvi49LYRftnoZlpQJZwi4MlgLbCFkk-ZFC_W4BHOmysAjOR_3XTB4R998&usqp=CAU",
      "content": "The right tortoise house is essential and sadly many tortoises do not thrive in a classic Vivarium style enclosure. Fortunately, we offer a number of habitats that are more than suitable for tortoises and terrapins. Unlike a standard reptile vivarium, the Vivexotic Viva Tortoise Table has been designed specifically for tortoises and features a removable tray, a play area and a stand.  The base of the pen has a metal skirt, which will prevent your tortoise from climbing and falling onto its back. The top of the pen has a table area where light and heat lamps can be fitted and the base tray is removable so that you can use this pen outdoors, placing it directly onto the grass.As much as possible you should try to mimic the natural environment that your tortoise would have lived in. Also be aware that if the tortoise enclosure is too moist it may encourage fungal growth, which can affect their health. You should include a basking area in the enclosure, as well as some shade so that your tortoise can move around and regulate their body temperature as required.Ideally the optimal temperatures in the tortoise enclosure should be between 21-32 degrees celsius. Exo Terra in particular are well known for making quality heating and lighting products for exotic pets.  Both the lamps and the thermometer in your starter kit will allow you to provide and monitor the right amount of heat and light for your tortoise. A heat mat will also provide gentle warmth that your tortoise will love to sit upon. Our range of feeding bowls have a natural effect, are easy to clean and are non-porous. They are designed to blend into the surroundings so that your tortoise will feel like it is foraging in the wild. Ensure that your tortoise always has access to shallow water for drinking and for soaking in.The main part of your tortoises diet will be made up of fresh vegetables such as leafy greens, with some vegetation like dandelions for example. They will require protein from small live insects such as mealworms or crickets and fruit can also make up a small percentage of their diet. Calcium is particularly important to a tortoise, so be sure to add a supplement to their food twice a week.Once you have your tortoise enclosure ready, you will be able to look forward to a long and happy companionship. Browse our website today for many more products that will help to ensure that your tortoise will live a long and happy life.",
      "likes": 22,
      "tag": [
        "tortise-care"
      ]
    },
    {
      "id": "9",
      "author": "Richard Lewis",
      "title": "RED RUMPED PARAKEETS",
      "description": "Grass Parrot",
      "reading_time": "8 min read ",
      "date": "Feb 2",
      "source": {
        "name": "birdcagesnow"
      },
      "profile_url": "https://cdn.shopify.com/s/files/1/2422/3327/files/male_red_rump_parakeet_large.jpg?v=1594144426",
      "urlToImage": "https://cdn.shopify.com/s/files/1/2422/3327/files/female_mulga_parrot_large.jpg?v=1594144444",
      "content": "Red Rump Parakeets (Psephotus haematonotus) are birds found in south-eastern Australia. They are also known as the Red-rumped Parakeet, Red-Backed Parrot, Red Rump Parrot, and Grass Parrot. They can often be found in open grasslands, places near rivers or streams, and lightly timbered plains with elevations of up to 3000 ft. Their population continues to rise as they are of least concern in the IUCN Red List.They are medium-sized parrots that are only 27-28 centimeters (10.5-11 inches) long with half of it being its tail, and a slim body that weighs 1.9-3 ounces (55-85 grams).The male red rump parakeet is primarily bright emerald green, they have yellow underparts, blue wings, and upper back highlights and a red rump. On the other hand, females are less vibrant with their dull green back and wings, olive underparts, and dark blue wingtips. Both genders have flesh-colored legs and a black beak.Red Rumped Parakeets have a balanced noise level, they’re not too noisy. Yet they are not too quiet either as most of the noise they make is soft call-like songs that consist of satisfying chirps and tweets.These birds make beautiful vocalizations. However, they are not inclined to mimic sounds or voices, they are not skilled talkers either. Yet, with a lot of perseverance and patience, it is possible to teach them to talk. It is ideal that you teach them this instead of bringing them to a professional as birds tend to learn efficiently when taught by someone they have a strong bond with. They are expected to live for 32 years with proper care and enough exercise. Although they commonly only live for 15 years in captivity. These birds have such pleasant and wonderful personalities, they are tremendously energetic and would love to roam around and explore their surroundings. They also love to socialize and will make sure that they spread affection towards those who spend time with them.Even though they are very social birds, they can still be aggressive and territorial towards their own kind, so it’s best to keep them alone or with a pair only. However, they are not prone to being aggressive towards us humans. Their tiny beaks won't do much harm either, so it won't be a problem to let them play with children as long as they are supervised. They require a lot of toys and attention for mental stimulation as they get bored easily. It’s best to spend time with them by hand feeding them or stroking them in order to strengthen your bond. ",
      "likes": 27,
      "tag": [
        "Parrots"
      ]
    },
    {
      "id": "10",
      "author": "Sophie",
      "title": "Why Parrots Need Fats In Their Diet",
      "description": "Sophie explains why Parrots need fats in their diet.",
      "reading_time": "5 min read ",
      "date": "Feb 8",
      "source": {
        "name": "northernparrots"
      },
      "profile_url": "https://www.northernparrots.com/images/blogs/blog_parrots_fats1580w.jpg",
      "urlToImage": "https://www.northernparrots.com/images/blogs/blog_parrots_fats3580w.jpg",
      "content": "Fat is a macronutrient which plays a vital role in keeping your bird healthy. All birds need to have some bioavailable fat in their diet. Including healthy fats in your Parrot’s diet is essential for many bodily functions, these include:Source of energy-Absorption of fat soluble vitamins (A, D, E, and K),Immune system support,Maintaining body temperature,Hormone regulation,Production of healthy feathers,Normal organ function,A diet lacking in fat can cause stunted growth in young birds, visual impairment, illness due to a poor immune system, poor feather quality, flaky skin, slow wound healing, and liver and kidney issues.A diet that is too high in fat can cause obesity, fatty liver disease, heart disease, high cholesterol and joint problems. Every cell in a bird’s body is covered with two layers of fat which shows just how important it is that you offer an appropriate amount of healthy fats in their diet.Some great sources of Parrot safe protein include:Organic red palm oil,Organic coconut oil,Organic tree nuts including walnuts, almonds, pecans and Brazil nuts,Seeds (in moderation and part of a balanced diet) including hemp seeds, pumpkin seeds and sunflower seeds,Freeze dried or live mealworms,Plain scrambled or boiled egg once or twice a week.As with all things in a Parrot’s diet, it’s important that fats aren’t the main component, a nothing should make up the majority – diversity and variety are key!",
      "likes": 19,
      "tag": [
        "northernparrots"
      ]
    },
    {
      "id": "11",
      "author": "Niko Bellec",
      "title": "Fill Your Garden With Birds This Winter",
      "description": "As the nights draw in and the weather gets colder, it’s not just us humans that require more to keep warm.",
      "reading_time": "4 min read ",
      "date": "Aug 28 , 2021",
      "source": {
        "name": "Thepetexpress"
      },
      "profile_url": "https://www.thepetexpress.co.uk/blog-admin/wp-content/uploads/2013/10/Bird.jpg",
      "urlToImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTy4nqCUVw6Ef0acobCJsHk7Xa4rljRsFGgIKKLKQCcZKYYBAYzYy1hNa9WWJIdfkCedN8&usqp=CAU",
      "content": "As the nights draw in and the weather gets colder, it’s not just us humans that require more to keep warm. The wildlife that commonly visits our gardens during summer gradually reduces in numbers throughout autumn and into winter, with only a few species of hardy birds staying behind. While others flee to warmer climates, many native species stick around and try to survive the harsh temperatures that the winter can bring.But that’s not to say they don’t need our help. A recent study by the RSPB, in conjunction with 25 other wildlife organisations, has found that 60% of bird species in the UK have declined in recent years, largely due to a loss of habitat. This loss of habitat has also meant a reduced food source for birds, especially during winter where insects and bugs are scarce. And this is where we come in; by providing even a small but regular food source for our local wildlife, we could make a big difference to the future of a number of species in the UK.",
      "likes": 42,
      "tag": [
        "Birds"
      ]
    },
    {
      "id": "12",
      "author": "Craig washington",
      "title": "Bird Feeding - Wild Birds Care Guide",
      "description": "In addition to many other things, February has been dubbed Bird-Feeding Month, which has inspired us at the Pet Express to put together this neat little wild bird care and feeding guide.",
      "reading_time": "5 min read ",
      "date": "Feb 17 , 2022",
      "source": {
        "name": "wild-birds"
      },
      "profile_url": "https://www.thepetexpress.co.uk/blog-admin/wp-content/uploads/2015/02/bird-house-440180_1280-683x1024.jpg",
      "urlToImage": "https://www.thepetexpress.co.uk/blog-admin/wp-content/uploads/2015/02/aviary-8178_1280-1024x768.jpg",
      "content": "In addition to many other things, February has been dubbed Bird-Feeding Month, which has inspired us at the Pet Express to put together this neat little wild bird care and feeding guide. It may be surprising to learn that feeding birds is not actually as simple as throwing bread to ducks or scattering sesame seeds on the floor. As the seasons pass by, your bird feeding efforts need to change to take into consideration the bird's dietary needs, which are heavily dictated by the environmental surroundings.Before all that though, the first thing you should bird-house-440180_1280probably know is what kind of food you can feed to birds, and you'll be glad to know that the answer is quite a lot. Depending on how seriously you plan on taking your bird feeding efforts, however, you will probably only want to give them the kind of foods that will benefit them.Other than these, you can also feed them pre-prepared bird foods, such as suet pellets or seed mixes. You should also beware when leaving food out for birds that other animals may want a nibble too. If you have dogs or cats you should be particularly careful about leaving bird feed somewhere accessible, as some foods and artificial additives, whilst harmless to birds, are potentially toxic to some domestic animals.As we've stated previously, depending on the time of year and current climate you ought to provide different types of food. During the Autumn and Winter, a lot of birds moult in preparation for the low temperatures and it is important that as a bird feeder you adapt the food you are giving them in order to provide the best chance of survival. This can simply mean increasing the quantity of food you provide, as it will take fewer birds than normal to get through the food you would usually put out for them. Berries are a welcome addition to their meals, and an increase in peanuts, suet and sunflower seeds will certainly not go amiss.In Autumn and Summer their diet could do with becoming a little bit more balanced, and you may find that despite your garden is filled with feeding birds, you will actually not be providing that much food, proportionately speaking. Bear in mind however that Spring is the time of year that many birds will have their young, so you may decide that from around early April until June smaller, softer foods would be more ideal. Additionally, if you generally feed birds by leaving food on the ground make sure you moisten the earth, as eating off the hard ground may damage their beaks. ",
      "likes": 56,
      "tag": [
        "Wild Birds"
      ]
    },
    {
      "id": "13",
      "author": "Ezio Auditore",
      "title": "Beginner's Guide to Horse Riding",
      "description": "Horse Riding for Everyone",
      "reading_time": "8 min read ",
      "date": "Feb 8 , 2022",
      "source": {
        "name": "Horseridingnetwork"
      },
      "profile_url": "https://media.tacdn.com/media/attractions-splice-spp-674x446/07/3d/08/e4.jpg",
      "urlToImage": "https://cdn.drweil.com/wp-content/uploads/2016/12/health-wellness_health-centers_women_is-horseback-riding-harmful-to-women_2755%C3%971784_75254029-600x450.jpg",
      "content": "Many horse riders, particularly those struggling with nerves, anxiety and fear around riding, believe that confidence is either something they have, or they don’t. As if confidence is some magical, mystical thing that some riders are lucky enough to have or not.But this is simply untrue! Confidence is a skill that can be learned. Just like learning to do rising trot (or posting if you’re in the USA!), or learning to jump. All of us can learn how to become more confident when riding, no matter our individual starting points. It doesn’t matter whether you’re an experienced competitive rider who’s ridden for years, or a beginner who has started taking lessons at a riding school. Regardless of the causes of your nerves, anxiety and/or fear, you can learn how to (re)build your mindset and create real, long-lasting confidence around riding. ",
      "likes": 19,
      "tag": [
        "Horse"
      ]
    },
    {
      "id": "14",
      "author": "Jason Riley",
      "title": "Essential Tips for Taking Care of the Horses",
      "description": "Having a horse is a bit like having a child – but with more mess! If you’re like most horse owners, stable care is part and parcel of your daily life.",
      "reading_time": "7 min read ",
      "date": "Dec 18 , 2021",
      "source": {
        "name": "equestrianco"
      },
      "profile_url": "https://theultimateequestrian.com/wp-content/uploads/2018/06/image-9.jpg",
      "urlToImage": "https://thumbs.dreamstime.com/b/cleaning-horse-5210202.jpg",
      "content": "Obviously, your horse will need his food if you want him to be happy and healthy. While you can measure it out each time you go down, it generally saves time to buy a set of scales and a series of small buckets labelled with breakfast and dinner. On a quiet day, measure out enough meals for the rest of the week.It’s up to you whether you use straw or shavings, but your horse’s stable needs to be kept clean either way. Some people only do light mucking out during the week and then remove the entire bed and replace it over the weekend, whereas others prefer to muck out daily. Make sure to remove any wet or soiled patches and pick out any manure. It’s easiest to do this with the horse outside of the stable. Stable duties aren’t just limited to stables, unfortunately! Remove manure from your paddocks regularly – either daily in small amounts, or thoroughly at least once a week.Make sure you fill up your buckets with fresh water each and every day.At least once a day, a horse should get a good grooming to remove mud and dust. You should also pick out his feet and give your horse a quick brush before riding to stop dirt and mud rubbing against his skin while you ride. Your horse needs enough hay or haylage to last the entire night in order to prevent ulcers and colic. Use a haynet, or just feed from the floor! You can prepare enough haynets for the entire week on one day, if you want to save time on busy days.Feed and water buckets (or automatic waterers) will need regular scrubbing to prevent bacteria and grime. Warm water, a hard brush and some elbow grease will be your best friends here! If stains are stubborn, some white vinegar can help to lift them. Finish off by giving the feed room, store room, your stable entrance and any walkways a good sweep after you’ve finished the rest of your stable chores.",
      "likes": 72,
      "tag": [
        "Horse"
      ]
    },
    {
      "id": "15",
      "author": "James walt",
      "title": "DO GOLDFISH EAT EACH OTHER",
      "description": "Goldfish by nature are not aggressive, and are not predatory. ",
      "reading_time": "9 min read ",
      "date": "Oct 27 , 2021",
      "source": {
        "name": "mypetwarehouse"
      },
      "profile_url": "https://cdn.powered-by-nitrosell.com/public_html/12/2853/media/images/blog/thumbnails/do%20goldfish%20eat%20each%20other.jpg",
      "urlToImage": "https://cdn.powered-by-nitrosell.com/public_html/12/2853/media/images/blog/photos/img-grown-goldfish.jpg",
      "content": " Goldfish by nature are not aggressive, and are not predatory. The short answer would be,No, they don't eat each other. However, there are some circumstances where goldfish do eat each other. Goldfish tend to browse for food, eating mostly what are bite-sized morsels, of anything edible. But, if they happen to come across small fish (e.g. baby goldfish), they do not discern, and they will eat it if they can catch it.At breeding time, goldfish produce hundreds of sticky eggs. Goldfish exhibit no parental care, and they will graze on the eggs, regardless of whether it is theirs. Similarly, those eggs that survive and go on to hatch, the baby goldfish will continue to fall prey to anything that is larger - be it other goldfish, or insects (e.g. dragonfly larvae).Once goldfish are able to swim around, and are of adequate size (e.g. 2-3 centimeters), the rate of intra-specific predation drops dramatically.",
      "likes": 192,
      "tag": [
        "Fish"
      ]
    },
    {
      "id": "16",
      "author": "Soren Kirk",
      "title": "HOW TO CARE FOR GOLDFISH",
      "description": "Autoimmune conditions are on the rise, but medicine lags behind",
      "reading_time": "6 min read ",
      "date": "Feb 11 , 2022",
      "source": {
        "name": "Mypetwarehouse"
      },
      "profile_url": "https://cdn.powered-by-nitrosell.com/public_html/12/2853/media/images/blog/thumbnails/how%20to%20care%20for%20goldfish.jpg",
      "urlToImage": "https://cdn.powered-by-nitrosell.com/public_html/12/2853/media/images/blog/thumbnails/how%20to%20cycle%20your%20fish%20tank%20infographic.jpg",
      "content": "Ever wondered how to care for goldfish? It's actually quite simple and once you learn the basics you’ll be ready to raise a happy and healthy pet. When you think of a goldfish you picture a small orange fish that lives in a glass bowl, right? Well, this common visualisation of a goldfish’s home is outdated and is actually very cruel. Not to mention there’s many different shapes and colour variations of these popular fish.Goldfish thrive in an indoor tank environment where they have enough space to swim and good quality water. Read on below to find out what else your pet fish will need.As previously mentioned, a small bowl is not the ideal environment for a goldfish. Instead they will need an aquarium tank that will accommodate their growing bodies. This tank can be either made from acrylic or glass.Healthy goldfish can live up to 20 years. Yes you read that correctly – 20 years! Because of this it is important to get the largest fish tank that you have space for and that you can afford. This is especially true if you wish to own a small school of goldfish.This means that depending on how many goldfish and what length they are,the size of your tank may differ. Also bear in mind that as your goldfish grow you will have to upgrade their tank to give them enough space.        The common goldfish can grow up to 30cm long. That means that one 30cm goldfish would need a 132 litre fish tank just for themselves! The beauty of the formula above is that you can continue to use it as your fish get bigger to make sure there is always enough space.One of the awesome things about having a pet goldfish is that you can decorate their tank! There are many different types of landscaping objects for your aquarium to make it a feature of your home.",
      "likes": 55,
      "tag": [
        "Gold Fish"
      ]
    }
  ],
  "trending_feeds": [
    {
      "id": "1",
      "author": "James walt",
      "title": "HOW TO STOP YOUR DOG FROM JUMPING",
      "description": "Think about the process of how to stop your dog from jumping as a puzzle; there are several pieces that will need to be put together in order for you to achieve lasting results.",
      "reading_time": "9 min read ",
      "date": "Oct 27 , 2021",
      "source": {
        "name": "Peachonaleash"
      },
      "profile_url": "https://peachonaleash.com/wp-content/uploads/2022/06/shutterstock_1993636730-1536x1024.jpg",
      "urlToImage": "https://peachonaleash.com/wp-content/uploads/2022/06/shutterstock_1982446985-1024x683.jpg",
      "content": "You may have been instructed to sternly respond to your dog's jumping by pushing them away, saying off! and/or even kneeing them in the chest. But while these methods might stop the behavior in the moment, they don't get to the root of the behavior, and as a result, it will likely continue.Generally speaking, dogs jump because it works. It provides them with attention, physical connection to you, and can provide an outlet for frustration and excitement.It's worth noting that if a dog is fearful or uncomfortable around new people, jumping can serve as a way to gather information about the person, and may not be a friendly behavior. In these instances, please contact a qualified behavior professional in your area.If you're concerned that your dog could be jumping on you as a way to assert dominance, you can set those fears aside! It's been well-documented in the latest scientific research that dogs do not seek a status hierarchy with humans; the article linked here was actually written by the scientist who originally coined the term alpha in regards to wolves and their social relationships.",
      "likes": 192,
      "tag": [
        "Dogs"
      ]
    },
    {
      "id": "2",
      "author": "Craig washington",
      "title": "Parrot Training",
      "description": "Think of training your parrot this way; every interaction you have with your bird is a training session, whether you like it or not.",
      "reading_time": "5 min read ",
      "date": "Feb 17 , 2022",
      "source": {
        "name": "birdtricksstore"
      },
      "profile_url": "https://farm6.static.flickr.com/5199/5818660880_c10d64ffee.jpg",
      "urlToImage": "https://farm3.static.flickr.com/2258/5818091531_8851ba232b.jpg",
      "content": "Think of training your parrot this way; every interaction you have with your bird is a training session, whether you like it or not. In that time you are either doing something to increase the likelihood your bird is going to repeat that current behavior it's showing or decrease the likelihood through your actions. For example, if every time your bird comes out with person A and always goes back into the cage with person B, it's likely the bird will be eager to see person A and bond more strongly to that person than person B. It's also likely the bird will begin to resist going to person B by ignoring or running/flying away and later that behavior escalates to lunging and biting.  With a basic understanding in parrot training person B could easily avoid or repair this situation with any of the following training methods:Target training the bird back into cage, Randomly rewarding the bird for going back into the cage,Applying the 60/40 rule.You will use these again and again, they're more powerful than I can express. Make sure these are trained to 100% consistency because these will be the foundation of your training.There's one thing that gives most parrot owners a hang up on training and that's finding the proper reward (remember, it doesn't have to be food and variety is the key to success!) so lets talk about food motivation.Once you are armed with your 3 fundamental tools of your bird's favorite treat (one he/she is willing to work for), your clicker (and your bird's understanding of its meaning) and your target stick - you are fully capable of adding and deleting behaviors your bird displays.",
      "likes": 56,
      "tag": [
        "Train Parrot"
      ]
    },
    {
      "id": "3",
      "author": "Richard Lewis",
      "title": "How To Train A Cat",
      "description": "Cats are intelligent animals that can be trained",
      "reading_time": "8 min read ",
      "date": "Feb 2",
      "source": {
        "name": "basepaws"
      },
      "profile_url": "https://cdn.shopify.com/s/files/1/0087/3798/0475/articles/00-18_1400x.jpg?v=1603963926",
      "urlToImage": "https://cdn.shopify.com/s/files/1/0437/1867/2543/files/i5iPU.jpg",
      "content": "Cats are intelligent animals that can be trained! If you find the right way to work with them, you can teach them wonders. Training your cat will help them be more social, less anxious and overall more content. Here is your How to train a cat- guide with a few tips to get you started on the journey.First and foremost, ask yourself what exactly you want your kitty to learn? Do you wish to correct inappropriate behavior (i.e. furniture scratching) or teach your cat some cool tricks (i.e. high five)? The applied technique will be determined by the type of behavioral action you will be teaching. Once you have decided what to work on, you can start slowly moving forward together with your furry friend. Some of the common objectives in cat training are:Using the litter box,No scratching or jumping on furniture,No biting,Following commands such as come, sit, stay, high five, roll over, jump etc.,Training a cat not to do something,Teaching a cat new tricks.The time and duration of a lesson has to be adapted to your cat’s mood and interest. Cats have a shorter attention span than us and they like to do things how and when they want to do it. This means that you will have to train with your pet when they’re interested in it and for as long as this interest lasts. The most effective training sessions are usually short, but frequent and natural. It is important to remain calm, patient and, before all, persistent. Don’t give up if your cat doesn’t progress as quickly as you had hoped. They are independent and strong-willed, which requires a lot of patience on your end.While it is possible for cats to learn a few things simultaneously, it is thought to be most effective to teach them one thing at the time. To be utmost successful, allow your cat to master the respective objective before moving on to a new one.Cats respond very well to the system of positive reinforcement. Our favorite pets love doing things they get something good out of. Therefore, whenever your feline does something well, reward her with an encouraging praise, scratch or a treat. You can also use the clicker every time you reward them. This way they will make a connection between the objective, the reward and the clicker sound. Every time they hear the clicker, they will know they did the job well.Cats typically do not respond well to punishment. This type of disciplinary methods is not found to be helpful and it often triggers stress and anxiety. Instead, whenever you spot an inappropriate behavior, try to distract your cat. For example, if you’re teaching them not to scratch the furniture – every time you see them do it – make a quick, sharp sound (i.e. whoa!). The cat will be distracted and stop the action. Be consistent with the sound choice and avoid using common words like hey or no. This is to avoid the confusion when they hear these sounds in different contexts.It is recommended for other family members and frequent visitors to be involved in your training too. Everyone should know what the ultimate goal is and which method you’re employing. For example, every person who spots the cat scratching the sofa needs to react and apply the same corrective measurement like you.If you’re bringing home a kitten, you may want to start teaching them certain behaviors early on. For example, socializing the kittens and getting them used to being handled and groomed is all easier done early in the kitten-hood. Raising kittens in this way will make it easier for us to take care of them when they grow up.",
      "likes": 27,
      "tag": [
        "Cat Love"
      ]
    },
    {
      "id": "4",
      "author": "Athena Csuzdi",
      "title": "HOW TO TRAIN YOUR TURTLE",
      "description": "A turtle is no dragon, so right off the bat Athena Csuzdi, a biologist at the Vancouver Aquarium Marine Science Centre, has that going for her. But that doesn’t mean that training a turtle is easy.",
      "reading_time": "5 min read ",
      "date": "Feb 8",
      "source": {
        "name": "aquablog"
      },
      "profile_url": "https://www.aquablog.ca/wp-content/uploads/2015/04/resize-big-Footage.01_06_56_25.Still003.jpg",
      "urlToImage": "https://www.aquablog.ca/wp-content/uploads/2015/04/resize-feature-Footage.01_05_07_18.Still002.jpg",
      "content": "A turtle is no dragon, so right off the bat Athena Csuzdi, a biologist at the Vancouver Aquarium Marine Science Centre, has that going for her. But that doesn’t mean that training a turtle is easy.Animal husbandry (healthcare) is the main reason for training an animal using a target. By having the pig-nosed turtle “station” in a particular area of the habitat, Athena can make sure she is getting enough to eat, while also doing a visual check of her body at the same time. She says target feeding plays a particularly important role when an Aquarium biologist needs to give medicine to an animal.Athena says it took time and patience to go through the steps with the pig-nosed turtle (Carettochelys insculpta) in the newly expanded Tropic Zone gallery:Place food in the habitat and make sure the pig-nosed turtle is eating that first,Start feeding in a particular area and introduce the target (a pink Wiffle ball at the end of a stick),Hold the target closer to the food to reinforce the association that the target signals food,Show the target and have the turtle “station” (wait in a specific area) before offering the food",
      "likes": 19,
      "tag": [
        "Turtle"
      ]
    },
    {
      "id": "5",
      "author": "Marina Gomez",
      "title": "Horse Training ",
      "description": "The Ultimate Checklist BEFORE You Start Your Horse",
      "reading_time": "4 min read ",
      "date": "Jan 14",
      "source": {
        "name": "Gabineurohr"
      },
      "profile_url": "https://www.gabineurohr.com/images/blog/Checklist/blog-checklist-article-TR2_5114.jpg",
      "urlToImage": "https://www.gabineurohr.com/images/blog/loving-boundaries/blog-20170523-_R1_6243.jpg",
      "content": "When it comes to starting your horse under saddle, there are so many things to consider, so many decisions to make for the best of your horse. You want to do everything you can to make this experience a good and positive one for your horse.I made for you a complete checklist about every important point you want to think about before you start your horse. With this list you can make every single decision with full awareness and have your horse perfectly prepared for this so important step in his life.Boundaries are so important in our relationship with horses. It is a difficult topic and one of the most challenging things to do consistently and in a fair way for most horse owners. Whenever I set a boundary to my horse, my motivation behind is always the love for my horse. I want my horse to be able to live comfortably in our human's world. I want it to be easy for my horse to deal with all the restrictions that come with living in our world.  Loving a horse doesn’t mean that I let him do whatever he wants to do. Loving my horse means most importantly to ensure his long term safety and happiness.Big corrections will only become necessary if you ignore your inner voice or feeling of being unsafe when your horse oversteps a limit too often.If you learn to speak up and let your horse know quietly as soon as you feel this little voice, you will find yourself having to do a lot less.Corrections will reduce to a little raising of the hand to block the nose or a little quiet “Hey”.Learn to do less sooner before you have to do more later: If you see this from the horse's point of view, it would look like this. Your horse repeatedly passed a little limit, you felt this little uneasy feeling already quite a few times.Each time your horse passed the limit a little more and with more certainty. Because you didn’t give feedback that actually you don’t like this behaviour. So the longer you think your horse is doing something wrong, but you don’t tell your horse, the longer your horse thinks that what he does is ok and good.",
      "likes": 17,
      "tag": [
        "Horse training"
      ]
    },
    {
      "id": "6",
      "author": "Brock Corleone",
      "title": "The Beginners Guide to Keeping Fish",
      "description": "Are you thinking of dipping your toes into the water and start keeping fish as pets? They may not cuddle up to you on the sofa or accompany you on walks, but fish are truly fascinating creatures.",
      "reading_time": "4 min read ",
      "date": "Jan 24",
      "source": {
        "name": "Thepetexpress"
      },
      "profile_url": "https://www.thepetexpress.co.uk/blog-admin/wp-content/uploads/2018/07/Fish-e1531991087808.jpg",
      "urlToImage": "https://images.saymedia-content.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:eco%2Cw_1200/MTc0NDM2NTA1MDYwNjQ4NTgy/the-healing-power-of-pet-fish.jpg",
      "content": "Fish are more interactive than you might first think. They are entertaining to watch as they navigate their way around a tank, weaving in and out of rocks and plants. They will also rush to greet you at feeding time, coming to the surface for the tasty treats that you drop in. If you are looking for a pet to satisfy a child’s request, then fish are the perfect solution. They are not only easy to keep, but will teach children about being responsible for an animal’s life. From remembering to feed them to cleaning the tank, they will learn the importance of caring for something in order to keep it alive. It may also be an opportunity to ease your child into the subject of death and loss, when the inevitable happens and they discover a fish floating on the surface.The bigger the tank or aquarium the better. Most fish may be small in size, but they still need plenty of room to swim, especially if you have decided to get more than one. Whether you’re starting with a single goldfish or a few, browse our wide range of fish tanks for their new home.Think about where you place your tank. Keep it out of direct sunlight, away from windows and heating. The last thing you want is for the water in the tank to heat up out of your control. Invest in a decent filter. This will keep the water in the tank cleaner for longer, removing any debris, pollutants and waste.Add an air pump. This will keep the water in the tank oxygenated and keep it moving which is great for your fish. Pumps come in different sizes depending on the amount of litres your tank can hold. Our range of air pumps can provide a healthier underwater environment for your fish.Fish may need heat and light. Depending on the breed of fish, heating could be crucial. If your fish are tropical there will be certain temperatures that you to need to ensure the water is kept to. Goldfish and cold water fish are an exception and will require no heat. Lighting will help any plant life in the tank to grow and will also show off the colours of your fish for you to enjoy. Add some gravel to the tank. Some bacteria is beneficial to fish and the gravel gives it somewhere to live. It will also help to break down any waste that your fish creates, as well as adding an attractive look to their surroundings.Include some plants and greenery. Using different varieties of plant life will give your fish somewhere to hide and play, helping them to feel safe. Real plants will help to maintain the nutrients in the tank, but artificial plants will work just as well for giving your fish somewhere to hide. Take a look at our great mix of tank ornaments and plants to keep your fish happy!",
      "likes": 22,
      "tag": [
        "aqua life"
      ]
    }
  ],
  "blogs": [
    {
      "post": "Enjoy what you have in life ,Happiness comes from within so love your self and others will love you too.",
      "title": "The Alchemist",
      "image": "http://res.cloudinary.com/dxma3isad/image/upload/v1657774335/buofwr7n1nvgcs2l1ice.jpg",
      "id": 37
    },
    {
      "post": "The article follows the natural sequence of the seven principles: being proactive, beginning with the end in mind, putting first things first, thinking win-win, seeking first to understand then to be understood, synergizing, and finally sharpening the saw.The article follows the natural sequence of the seven principles: being proactive, beginning with the end in mind, putting first things first, thinking win-win, seeking first to understand then to be understood, synergizing, and finally sharpening the saw.",
      "title": "7 Habits of Highly Effective People",
      "image": "http://res.cloudinary.com/dxma3isad/image/upload/v1657799187/rsgwv1pcsklu9hcpzeef.jpg",
      "id": 38
    },
    {
      "post": "Java is amazing",
      "title": "Java",
      "image": "http://res.cloudinary.com/dxma3isad/image/upload/v1658136735/tsf1refk4ppjvevapwpp.jpg",
      "id": 39
    }
  ],
  "users": [
    {
      "Name": "Babita",
      "email": "bishtbabita@gmail.com",
      "password": "1234",
      "id": 1
    },
    {
      "Name": "ee",
      "email": "ee",
      "password": "ee",
      "id": 3
    },
    {
      "Name": "ff",
      "email": "ff",
      "password": "ff",
      "id": 4
    },
    {
      "Name": "Anaya",
      "email": "anaya@gmail.com",
      "password": "123",
      "id": 5
    },
    {
      "Name": "Vikrant",
      "email": "v@gmail.com",
      "password": "1234",
      "id": 6
    },
    {
      "Name": "b",
      "email": "b@gmail.com",
      "password": "1234",
      "id": 7
    },
    {
      "Name": "Ryan",
      "email": "rnb@gmail.com",
      "password": "123",
      "id": 8
    },
    {
      "Name": "Reynolds",
      "email": "r@gmail.com",
      "password": "123",
      "id": 9
    },
    {
      "Name": "ds",
      "email": "e@gmail.com",
      "password": "sd",
      "id": 10
    },
    {
      "Name": "babita",
      "email": "bh@gmail.com",
      "password": "1234",
      "id": 11
    }
  ]
 
}

